app/controllers/homes_controller.rb

  def index
    @homes = Home.all
---
SELECT "homes".* FROM "homes"

  def create
    @home = Home.new(home_params)

    respond_to do |format|
      if @home.save
---
INSERT INTO "homes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 18 Mar 2015 03:48:08 UTC +00:00], ["updated_at", Wed, 18 Mar 2015 03:48:08 UTC +00:00]]

  def update
    respond_to do |format|
      if @home.update(home_params)
---
UPDATE "homes" SET "nombre" = ?, "telefono" = ?, "hora" = ?, "fecha" = ?, "updated_at" = ? WHERE "homes"."id" = 1  [["nombre", "gustavo"], ["telefono", 123], ["hora", 2015-03-18 03:00:00 UTC], ["fecha", Wed, 18 Mar 2015], ["updated_at", Wed, 18 Mar 2015 03:53:17 UTC +00:00]]

  def destroy
    @home.destroy
---
DELETE FROM "homes" WHERE "homes"."id" = ?  [["id", 1]]

    def set_home
      @home = Home.find(params[:id])
---
SELECT "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT 1  [["id", "1"]]